VERSION_LIST = [{'version': '1.0.0', 'date': '2021-01-22',
                 'info': '基本框架搭建，接入控制台（console）和QQ（cqhttp+NoneBot）'},
                {'version': '1.1.0', 'date': '2021-01-23', 'info': '完善框架，加入定时任务和QQ群功能'},
                {'version': '1.1.x', 'date': '2021-xx-xx', 'info': '在原有框架下，陆续加入了一系列插件'},
                {'version': '1.2.0', 'date': '2021-04-30', 'info': '整体结构优化，加入帮助信息查询'},
                {'version': '1.3.0', 'date': '2021-05-02', 'info': '拓展微信公众号接口（WCP+Flask），实现文本回复'},
                {'version': '1.3.2', 'date': '2021-05-03', 'info': '丰富请求类型，实现WCP图片收发'},
                {'version': '2.0.0', 'date': '2021-05-04', 'info': '控制台接口后台处理http请求，实现外部调用'},
                {'version': '2.0.1', 'date': '2021-05-05', 'info': '拓展邮箱接口和http请求处理'},
                {'version': '2.0.2', 'date': '2021-05-05', 'info': '为并行填报新增异常处理语句'},
                {'version': '2.1.0', 'date': '2021-05-05', 'info': '整合http服务接口，实现接口间调用'},
                {'version': '2.2.0', 'date': '2021-05-12', 'info': '加入WebApp接口（Web+Flask）'},
                {'version': '2.2.1', 'date': '2021-05-13', 'info': '调试WebApp接口，使其稳定工作'},
                {'version': '2.2.2', 'date': '2021-05-13', 'info': '为WebApp接口加入Cookie分配'},
                {'version': '2.2.3', 'date': '2021-05-25', 'info': '加入远程打印、少许微调'},
                {'version': '2.2.4', 'date': '2021-06-03', 'info': '插件回复机制优化，加入自动百度'},
                {'version': '2.3.0', 'date': '2021-06-04', 'info': '插件权限管理优化，加入问答机'},
                {'version': '2.4.0', 'date': '2021-06-05', 'info': 'QQ回复机制更新，后续消息无需at'},
                {'version': '2.4.1', 'date': '2021-06-05', 'info': '问答机支持响应拓展关键词'},
                {'version': '2.4.2', 'date': '2021-06-07', 'info': '整理各模块呼出逻辑'},
                {'version': '2.4.3', 'date': '2021-06-08', 'info': '新增所有平台的异常处理，加入报错测试模块'},
                {'version': '2.4.4', 'date': '2021-06-08', 'info': '修复问答机和填报模块，修复呼叫逻辑'},
                {'version': '2.5.0', 'date': '2021-06-13', 'info': '加入微信接口（Wechaty），实现图片收发'},
                {'version': '2.5.1', 'date': '2021-06-14', 'info': '完善微信接口，实现加好友、定时群发'},
                {'version': '2.5.2', 'date': '2021-06-15', 'info': '微信接口修复'},
                {'version': '2.5.3', 'date': '2021-06-19', 'info': '加入arxiv插件'},
                {'version': '2.6.0', 'date': '2021-06-21', 'info': '增强插件的消息处理（ArgSession），可用单一命令设置参数'},
                {'version': '2.6.1', 'date': '2021-07-25', 'info': '增强天气插件'},
                {'version': '2.6.2', 'date': '2021-07-26', 'info': '回台，定时任务更新，增强天气插件'},
                {'version': '2.7.0', 'date': '2021-07-27', 'info': '加入关键词-同义指令处理'},
                {'version': '2.7.1', 'date': '2021-07-27', 'info': '调整同义词处理逻辑，防止循环出错'},
                {'version': '2.7.2', 'date': '2021-07-27', 'info': '天气插件支持返回行政区划'},
                {'version': '2.7.3', 'date': '2021-07-28', 'info': '接入彩云小译API、为天气加入坐标输入'},
                {'version': '2.8.0', 'date': '2021-07-29', 'info': '接入腾讯云快速语音识别API，支持微信端'},
                {'version': '2.8.1', 'date': '2021-07-30', 'info': '修复，腾讯云语音识别，通过url+SDK完成amr识别（失败）'},
                {'version': '2.8.2', 'date': '2021-07-30', 'info': '接入腾讯云翻译API'},
                {'version': '2.8.3', 'date': '2021-07-31', 'info': '修复，支持QQ端语音识别'},
                {'version': '2.8.4', 'date': '2021-08-01', 'info': '修复QQ消息回复逻辑，支持空句和长句'},
                {'version': '2.8.5', 'date': '2021-08-02', 'info': '问答机和同义词机改用utf-8编码，支持emoji'},
                {'version': '2.8.6', 'date': '2021-08-02', 'info': '支持消息等待（Standby），修复分拣流程'},
                {'version': '2.8.7', 'date': '2021-08-02', 'info': '加入国科大办事大厅行程申报（SIK）插件'},
                {'version': '2.9.0', 'date': '2021-08-03', 'info': 'Web端支持图片回复，优化QQ端，修复SIK插件'},
                {'version': '2.9.1', 'date': '2021-08-03', 'info': '加入国科大SEP登录获取Cookie插件，配合SIK'},
                {'version': '2.9.2', 'date': '2021-08-04', 'info': '修复微信端消息转义，支持SEP-SIK联动'},
                {'version': '2.9.3', 'date': '2021-08-04', 'info': '支持点歌，修复支持回复QQ端“回复”类消息'},]

INTRODUCTION = {'Default': "你好！我是MultiBot（V%s）。"
                           "回复“更多”了解详情，回复“帮助”查看使用指南。" % VERSION_LIST[-1]['version'],
                'CQ': "你好！我是QQ上的MultiBot，这里功能最完善，但消息有小概率被拦截。"
                      "回复“更多”了解详情，回复“帮助”查看使用指南，回复“填报”部署疫情填报。",
                'WCP': "你好！我是公众平台上的MultiBot，这里连接稳定，但仅支持被动回复一条消息。"
                       "回复“更多”了解详情，回复“帮助”查看使用指南（仅前600字），回复“填报”部署疫情填报。",
                'Wechat': "你好！我是微信上的MultiBot，这里功能基本完善，支持文字、图片、语音、地理位置。"
                          "机器人通过个人资料的性别来甄别普通用户和官方号，"
                          "如果你的资料性别为空，请联系开发者添加白名单，否则不会回复。"
                          "回复“更多”了解详情，回复“帮助”查看使用指南。",
                'WebApp': "你好！我是网页上的MultiBot，这里连接稳定，支持图文回复。"
                          "回复“更多”了解详情，回复“帮助”查看使用指南，回复“填报”部署疫情填报，回复“申报”进行行程申报。"}

DESCRIPTION = """MultiBot V%s (updated %s)

[概述]
通信软件自动化与消息处理插件的框架
用面向对象编程的思路，模块化地实现消息的处理和发送
从而使插件兼容QQ、微信、邮件等多种通信方式，节约开发成本

[接口描述]
ConsoleIO：控制台交互，拥有最高权限，可以返回图片，但只接收文本命令
Email：通过Flask实现外部调用发送邮件
QQBot：用cqhttp+nonebot实现的QQ即时通信和定时任务，功能最丰富
WCPublic：用Flask+wechatpy实现的微信公众号被动回复，每次只能回复一条消息
Wechat：用Wechaty实现的微信交互，可以返回图片
WebApp：用Flask实现的网页交互，只能收发文本消息

[网址]
-

[版本目标]
1.0+：迁移原GNB_NoneBot聊天机器人的插件
1.5+：拓展Wechaty、微信公众号、邮箱接口
2.0+：不同接口之间互相调用的能力（例如通过QQ命令发送微信消息）
3.0+：建立同学数据库，实现任务主动点对点通知
3.5+：加强网页端能力（如保存历史记录、广播）

[反馈]
QQ机器人账号：1976787406（不加好友）
QQ机器人测试群：230697355（目前手动审批）
作者邮箱：mengyuxi16@mails.ucas.ac.cn""" % (VERSION_LIST[-1]['version'], VERSION_LIST[-1]['date'])
